@echo off

echo ######################################
echo               伺服器啟動
echo ######################################
echo.
echo               伺服器設置
echo ######################################
echo 最小記憶體 1024 MB
echo 最大記憶體 1024 MB
echo ######################################
echo.
echo ######################################
echo 按 Ctrl+C 關閉伺服器
echo ######################################
java -Xmx1024M -Xms1024M -jar minecraft_server.1.11.2.jar nogui
echo ######################################
echo               伺服器關閉
echo ######################################